SampleXmlFiles/test2.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Body>
        <m:login xmlns:m="http://www.example.org/login">
            <m:username>admin</m:username>
            <m:password>test</m:password>
            <m:password>password</m:password>
            <m:password>admin</m:password>
        </m:login>
    </soap:Body>
</soap:Envelope>